{
  "basics": {
    "name": "Adrian Alan Pol",
    "label": "Software Engineer",
    "picture": "images/adrianalanpol.jpg",
    "x_pictureFallback": "images/adrianalanpol.jpg",
    "summary": "",
    "x_title": "",
    "introduction1": "Hi, I'm Adrian. I am a software engineer and machine learning researcher working on a $500M <a href='https://cms.cern/'>physics experiment</a> with 4000 scientists worldwide.",
    "introduction2": "I cooperate in multidisciplinary and multicultural teams to integrate and scale the state-of-the-art deep learning in the production code.",
    "introduction3": "In my free time I share my passion for science and technology by showing the <a href='https://home.cern/science/accelerators/large-hadron-collider'>Large Hadron Collider (LHC)</a> to the public as an official guide.",
    "introduction4": "I focus on generative models, anomaly detection and inference optimization. I published my findings in Nature, ICLR, NeurIPS, IEEE.",
    "introduction5": "I enjoy good tea and wine.",
    "location": {
      "country": "Switzerland",
      "region": "Geneva"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "adrianalanpol",
        "url": "https://www.linkedin.com/in/adrianalanpol",
        "x_icon": "fab fa-linkedin"
      },
      {
        "network": "GitHub",
        "username": "AdrianAlan",
        "url": "https://github.com/AdrianAlan",
        "x_icon": "fab fa-github"
      },
      {
        "network": "Scholar",
        "username": "dKzjiuEAAAAJ",
        "url": "https://scholar.google.com/citations?user=dKzjiuEAAAAJ&hl=en",
        "x_icon": "fas fa-book"
      }
    ]
  },
  "news": [
    {
      "title": "Poster at ICLR 2023 in Kigali",
      "content": "I was proud to present our work on quantization, preprint available <a href='https://arxiv.org/abs/2210.08502'>here</a>.",
      "date": "1 May 2023"
    },
    {
      "title": "Talk at HEX Seminar at Rutgers University",
      "content": "I gave a talk titled <i>Model Compression for the Hardware Trigger</i>.",
      "date": "11 November 2022"
    },
    {
      "title": "Talk at ML@L1 Trigger Workshop at Fermilab LPC",
      "content": "I presented our latest results on  <i>Machine Learning Anomaly Detection with Calorimeter Data for Run 3 and Beyond</i>.",
      "date": "13 October 2022"
    },
    {
      "title": "Talk at Hammers and Nails 2022 at Weizmann Institute of Science",
      "content": "I gave a talk titled <i>Model Compression Methods for the Hardware Trigger</i>'. Talk coveres application of novel quantization heuristics.",
      "date": "9 August 2022"
    },
    {
      "title": "Lecture at 4th Computational and Data Science School for HEP at Princeton University",
      "content": "I gave 8 hours of lecures and tutorials that covered introduction to machine learning, decision trees, deep learning, convolutional neural networks, graph neural networks,  unsupervised machine learning and autoencoders.",
      "date": "2 August 2022"
    },
    {
      "title": "Our paper was accepted for publication in <i>Machine Learning: Science and Technology</i> journal",
      "content": "Paper titled <i>Lightweight jet reconstruction and identification as an object detection task</i> was accepted for pubilication. Preprint <a href='https://arxiv.org/abs/2202.04499'>here</a>.",
      "date": "4 July 2022"
    },
    {
      "title": "Contribution at the 5th Inter-Experiment Machine Learning Workshop at CERN",
      "content": "I co-authored a talk on <i>Machine Learning for SUEP Detection</i>",
      "date": "13 May 2022"
    },
    {
      "title": "Co-organizer of NVIDIA DLI workshop at AMLD 2022 at EPFL",
      "content": "In this workshop I covered the <i>Fundamentals of Deep Learning</i> course for the audience of over fifty attendands.",
      "date": "27 April 2022"
    },
    {
      "title": "The book 'Artificial Intelligence for High Energy Physics' was published",
      "content": "From the book description on <a href='https://www.amazon.com/Artificial-Intelligence-High-Energy-Physics/dp/9811234027'>Amazon</a>: The Higgs boson discovery at the Large Hadron Collider in 2012 relied on boosted decision trees. Since then, high energy physics (HEP) has applied modern machine learning (ML) techniques to all stages of the data analysis pipeline, from raw data processing to statistical analysis. The unique requirements of HEP data analysis, the availability of high-quality simulators, the complexity of the data structures (which rarely are image-like), the control of uncertainties expected from scientific measurements, and the exabyte-scale datasets require the development of HEP-specific ML techniques. While these developments proceed at full speed along many paths, the nineteen reviews in this book offer a self-contained, pedagogical introduction to ML models' real-life applications in HEP, written by some of the foremost experts in their area.",
      "date": "14 March 2022"
    }
  ]
}